Lembed/Lembed-Canduino-Firmware/Add-on/boards.txt
canduino.name=Lembed canduino

canduino.vid.0=0x2341
canduino.pid.0=0x0043
canduino.vid.1=0x2341
canduino.pid.1=0x0001
canduino.vid.2=0x2A03
canduino.pid.2=0x0043

canduino.upload.tool=avrdude
canduino.upload.protocol=arduino
canduino.upload.maximum_size=32256
canduino.upload.maximum_data_size=2048
canduino.upload.speed=115200

canduino.build.mcu=at90can128
canduino.build.f_cpu=16000000L
canduino.build.board=canduino
canduino.build.core=arduino:arduino
canduino.build.variant=canduino

canduino.bootloader.tool=avrdude
canduino.bootloader.low_fuses=0xFF
canduino.bootloader.high_fuses=0x18
canduino.bootloader.extended_fuses=0xF5
canduino.bootloader.file=canduino/AT90CAN_boot_canduino.hex
canduino.bootloader.unlock_bits=0x3F
canduino.bootloader.lock_bits=0x0F
